_orgs/_posts/network/2018-01-03-ccna-7th.org
#+TITLE:    CCNA
#+AUTHOR:   Rengui Zhao
#+EMAIL:    zrg1390556487@gmail.com
#+LANGUAGE:  cn
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:plain toc:t ltoc:t mouse:underline buttons:0 path:http://cs3.swfc.edu.cn/~20121156044/.org-info.js />
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://cs3.swfu.edu.cn/~20121156044/.org-manual.css" />
#+HTML_HEAD_EXTRA: <style>body {font-size:16pt} code {font-weight:bold;font-size:100%; color:darkblue}</style>
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT: 

#+BEGIN_EXPORT HTML
---
layout: post
title: CCNA
author: zrg
comments: false
description: CCNA 7th
categories:
- network
tags:
- CCNA
photos:
---
#+END_EXPORT

# (setq org-export-html-use-infojs nil)
# (setq org-export-html-style nil)

* 前言
: 
* 网络互连基础
|--------------------------------------------------+-------------------------------------------------------------------------------|
| ARP（Address Resolution Protocol，地址解析协议） |                                                                               |
|--------------------------------------------------+-------------------------------------------------------------------------------|
| 网络分段（network segmentation）                 | 为什么要使用？随着网络的增大，用户响应非常缓慢，而LAN数据流将发生严重阻塞。   |
|                                                  | 导致LAN阻塞的常见原因:                                                        |
|                                                  | 统一广播域或冲突域中的主机太多;                                               |
|                                                  | 广播风暴；                                                                    |
|                                                  | 组播数据流太多；                                                              |
|                                                  | 带宽太低；                                                                    |
|                                                  | 使用集线器扩展网络。                                                          |
|--------------------------------------------------+-------------------------------------------------------------------------------|
| 广播域（broadcast domain）                       | 指同一个网段中所有设备组成的集合，这些设备侦听该网段中发送的所有广播。        |
|--------------------------------------------------+-------------------------------------------------------------------------------|
| 冲突域（collision domain）                       | 以太网术语，指一种网络情形，即网段上的一台设备发送分组时，该物理网段上的其他  |
|                                                  | 所有设备都必须侦听它。                                                        |
|--------------------------------------------------+-------------------------------------------------------------------------------|
| MAC地址                                          |                                                                               |
|--------------------------------------------------+-------------------------------------------------------------------------------|
| IP地址                                           |                                                                               |
|--------------------------------------------------+-------------------------------------------------------------------------------|
| 集线器                                           |                                                                               |
|--------------------------------------------------+-------------------------------------------------------------------------------|
| 路由器                                           | 路由器实际上就是交换机——第3层交换机，用以组建互联网络。默认对广播域进行分割。 |
|                                                  | 与第2层交换机转发或过滤帧不同，路由器使用逻辑地址，并提供分组交换功能。路由器 |
|                                                  | 使用访问列表进行分组过滤。                                                    |
|                                                  | 路由器每个接口都提供不同的广播域。                                            |
|--------------------------------------------------+-------------------------------------------------------------------------------|
| 交换机                                           | 用途是让LAN更好地运行——优化其性能，向LAN用户提供更高的带宽。默认情况下，对冲  |
|                                                  | 突域进行分割。                                                                |
|                                                  | 交换机每个端口都是一个独立的冲突域。                                          |
|--------------------------------------------------+-------------------------------------------------------------------------------|
| 网桥                                             |                                                                               |
|--------------------------------------------------+-------------------------------------------------------------------------------|
|                                                  |                                                                               |
* 网络互联模型
| ISO（Intelnational Organization for Standardzation，国际标准化组织） |                                                |
| OSI（Open Systems Intelconnection，开放系统互联模型）                | 7层协议：                                      |
|                                                                      | 应用层：文件、打印、消息、数据库和应用程序服务 |
|                                                                      | 表示层：数据加密、压缩和转换服务               |
|                                                                      | 会话层：对话控制                               |
|                                                                      | 传输层：端到端连接                             |
|                                                                      | 网络层：路由选择                               |
|                                                                      | 数据链路层：成帧                               |
|                                                                      | 物理层：物理拓扑                               |
|----------------------------------------------------------------------+------------------------------------------------|
| "三次握手"协议                                                       |                                                |
|----------------------------------------------------------------------+------------------------------------------------|
* 以太网
|----------------------------------------------------------------------------------------------+------------------------------------------------------------------------|
| 以太网                                                                                       | 以太网是一种竞用的介质访问方法，可让一个网络中的所有主机共享链接带宽。 |
|----------------------------------------------------------------------------------------------+------------------------------------------------------------------------|
| CSMA/CD（Carrier Sense Multiple Access With Collision Detection，载波侦听多路访问/冲突检测） | 半双工以太网使用的一种冲突监测机制。                                   |
|----------------------------------------------------------------------------------------------+------------------------------------------------------------------------|


