_posts/network/2018-01-03-ccna-7th.html
---
layout: post
title: CCNA
author: zrg
comments: false
description: CCNA 7th
categories:
- network
tags:
- CCNA
photos:
---

<div id="outline-container-orgf066dbe" class="outline-2">
<h2 id="orgf066dbe">前言</h2>
<div class="outline-text-2" id="text-orgf066dbe">
<pre class="example">


</pre>
</div>
</div>
<div id="outline-container-org76edf98" class="outline-2">
<h2 id="org76edf98">网络互连基础</h2>
<div class="outline-text-2" id="text-org76edf98">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ARP（Address Resolution Protocol，地址解析协议）</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">网络分段（network segmentation）</td>
<td class="org-left">为什么要使用？随着网络的增大，用户响应非常缓慢，而LAN数据流将发生严重阻塞。</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">导致LAN阻塞的常见原因:</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">统一广播域或冲突域中的主机太多;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">广播风暴；</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">组播数据流太多；</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">带宽太低；</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">使用集线器扩展网络。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">广播域（broadcast domain）</td>
<td class="org-left">指同一个网段中所有设备组成的集合，这些设备侦听该网段中发送的所有广播。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">冲突域（collision domain）</td>
<td class="org-left">以太网术语，指一种网络情形，即网段上的一台设备发送分组时，该物理网段上的其他</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">所有设备都必须侦听它。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">MAC地址</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">IP地址</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">集线器</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">路由器</td>
<td class="org-left">路由器实际上就是交换机——第3层交换机，用以组建互联网络。默认对广播域进行分割。</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">与第2层交换机转发或过滤帧不同，路由器使用逻辑地址，并提供分组交换功能。路由器</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">使用访问列表进行分组过滤。</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">路由器每个接口都提供不同的广播域。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">交换机</td>
<td class="org-left">用途是让LAN更好地运行——优化其性能，向LAN用户提供更高的带宽。默认情况下，对冲</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">突域进行分割。</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">交换机每个端口都是一个独立的冲突域。</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">网桥</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc38e264" class="outline-2">
<h2 id="orgc38e264">网络互联模型</h2>
<div class="outline-text-2" id="text-orgc38e264">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ISO（Intelnational Organization for Standardzation，国际标准化组织）</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="org-left">OSI（Open Systems Intelconnection，开放系统互联模型）</th>
<th scope="col" class="org-left">7层协议：</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">应用层：文件、打印、消息、数据库和应用程序服务</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">表示层：数据加密、压缩和转换服务</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">会话层：对话控制</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">传输层：端到端连接</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">网络层：路由选择</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">数据链路层：成帧</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">物理层：物理拓扑</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">"三次握手"协议</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orged4afd1" class="outline-2">
<h2 id="orged4afd1">以太网</h2>
<div class="outline-text-2" id="text-orged4afd1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">以太网</th>
<th scope="col" class="org-left">以太网是一种竞用的介质访问方法，可让一个网络中的所有主机共享链接带宽。</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CSMA/CD（Carrier Sense Multiple Access With Collision Detection，载波侦听多路访问/冲突检测）</td>
<td class="org-left">半双工以太网使用的一种冲突监测机制。</td>
</tr>
</tbody>
</table>
</div>
</div>
